concept/uml/class/annulation.puml
@startuml diagramme_classes_annulation
title Diagramme de classes : Annulation — Ti'Baleine

skinparam monochrome false
skinparam roundcorner 8
skinparam classAttributeIconSize 0
skinparam defaultFontName Arial

class "Client" as Client {
  + Nom : string
  + Prenom : string
  + Adresse-mail : string
  + Numéro tel : string
  + Reference Reservation : string
  --
  + ReserverCreneau()
}

class "Administrateur" as Administrateur {
  + Identifiant : type
  + Mot de passe : type
  + Role : type
  --
  + AnnulerReservation()
}

class "Reservation" as Reservation {
  + Reference reservation : string
  + Lieu de départ : string
  + Date de départ : date
  + Heure de départ : enum
  + Statut : enum
  + Type d'excursion : enum
  + Nbre de place : int
}

class "Type de passager" as TypeDePassager {
  + Categorie : enum
  + Tarif : int
}

class "Notification" as Notification {
  + Message : string
}

Client --> Administrateur : Appel d'annulation
Client --> Reservation : avoir
Administrateur --> Reservation : annuler
Reservation --> Notification : induit
Reservation --> TypeDePassager : Contient

@enduml
