docs/uml/class/annulation.md
```mermaid
classDiagram
    class Client {
        +Nom: string
        +Prenom: string
        +Adresse-mail: string
        +Numéro tel: string
        +Reference Reservation: string
        ReserverCreneau()
    }
    class Administrateur {
        +Identifiant: type
        +Mot de passe: type
        +Role: type
        AnnulerReservation()
    }
    class Reservation {
        +Reference reservation: string
        +Lieu de départ: string
        +Date de départ: date
        +Heure de départ: enum
        +Statut: enum
        +Type d'excursion: enum
        +Nbre de place: int
    }
    class TypeDePassager {
        +Categorie: enum
        +Tarif: int
    }
    class Notification {
        +Message: string
    }

    Client --> Administrateur : Appel d'annulation
    Client --> Reservation : avoir
    Administrateur --> Reservation : annuler
    Reservation --> Notification : induit
    Reservation --> TypeDePassager : Contient
```
